{
    "acrostiche": "在 Typst 中管理首字母缩略词及其定义。",
    "algo": "美化算法排版。",
    "algorithmic": "Typst 的算法伪代码排版，灵感来自 LaTeX 中的 algorithmicx 包",
    "ansi-render": "provides a simple way to render text with ANSI escape sequences.",
    "ascii-ipa": "Converter for ASCII representations of the International Phonetic Alphabet (IPA)",
    "babble-bubbles": "A package to create callouts.",
    "based": "Encoder and decoder for base64, base32, and base16.",
    "big-todo": "Package to insert clear TODOs, optionally with an outline.",
    "bytefield": "A package to create network protocol headers",
    "cetz": "Drawing with Typst made easy, providing an API inspired by TikZ and Processing. Includes modules for plotting, charts and tree layout.",
    "chic-hdr": "Typst package for creating elegant headers and footers",
    "chordx": "A package to write song lyrics with chord diagrams in Typst.",
    "codelst": "A typst package to render sourcecode",
    "codetastic": "Generate all sorts of codes in Typst.",
    "colorful-boxes": "Predefined colorful boxes",
    "commute": "A proof of concept library for commutative diagrams.",
    "conchord": "Easily write lyrics with chords and generate colorful chord diagrams.",
    "ctheorems": "Theorem library based on (and compatible) with the classic typst-theorem module.",
    "diverential": "Format differentials conveniently.",
    "drafting": "Helpful functions for content positioning and margin comments/notes",
    "easy-pinyin": "Write Chinese pinyin easily.",
    "example": "An example package.",
    "finite": "Typst-setting finite automata with CeTZ",
    "fontawesome": "A Typst library for Font Awesome icons through the desktop fonts.",
    "funarray": "Package providing convenient functional functions to use on arrays.",
    "gentle-clues": "A package to simply create and add some admonitions to your documents.",
    "gloss-awe": "Awesome Glossary for Typst.",
    "glossarium": "Glossarium is a simple, easily customizable typst glossary.",
    "gviz": "Generate graphs using the graphviz dot language.",
    "idwtet": "Package for uniform, correct and simplified typst code demonstration.",
    "in-dexter": "Hand Picked Index for Typst.",
    "leipzig-glossing": "Linguistic interlinear glosses according to the Leipzig Glossing rules",
    "lemmify": "Theorem typesetting library.",
    "lovelace": "Algorithms in pseudocode, unopinionated and flexible",
    "metro": "Typset units and numbers with options.",
    "minitoc": "An outline function just for one section and nothing else",
    "nth": "Add english ordinals to numbers, eg. 1st, 3nd, 2rd, 4th.",
    "numberingx": "Extended numbering patterns using the CSS Counter Styles spec",
    "ouset": "Package providing over- and underset functions for math mode.",
    "oxifmt": "Convenient Rust-like string formatting in Typst",
    "physica": "Physics: derivative, differential, field, matrix, braket, tensor, hbar, etc.",
    "plotst": "A library to draw a variety of graphs and plots to use in your papers",
    "polylux": "Presentation slides creation with Typst",
    "prooftrees": "Proof trees for natural deduction and type theories",
    "quill": "A library for creating quantum circuit diagrams.",
    "rubby": "Add ruby (furigana) next to base text.",
    "showybox": "Colorful and customizable boxes for typst",
    "splash": "A library of color palettes for Typst.",
    "statastic": "A library to calculate statistics for numerical data",
    "syntree": "Linguistics syntax/parse tree rendering",
    "t4t": "A utility package for typst package authors",
    "tablex": "More powerful and customizable tables in Typst.",
    "tbl": "Complex tables, written concisely",
    "tidy": "Documentation generator for Typst code in Typst.",
    "unify": "Format numbers, units, and ranges correctly.",
    "whalogen": "Typesetting chemical formulae, a port of mhchem",
    "xarrow": "Variable-length arrows in Typst."
}